#include <iostream>

using namespace std;

void main()
{
	printf("Hello World\n");

	// 프로그래밍을 배우기전에 꼭 알아야하는 내용

	// 프로그래밍을 어느정도 마스터 할때까지는 Visual Studio를 사용함.
	// Visual Studio에 대해 알아야함.

	// Visual Studio 단축키
	// Ctrl + space : 인텔리전스 불러오기
	//		pri 적은후에 Ctrl + space 해보기
	// 드래그한 상태 + (Ctrl + K) + C : 주석
	// 드래그한 상태 + (Ctrl + K) + U : 주석 풀기
	// Ctrl + Shift + F : 검색
	// Ctrl + , : 코드 검색

	// Ctrl + F5 : 디버깅하지 않고 시작
	// F5 : 디버깅으로 시작

	// 프로그래밍을 할 때 꼭 지켜야하는 내용 (C++)
	// 프로그래밍을 항상 괄호가 시작하면 괄호를 닫아줘야함.
	//   [어떤내용이던 상관없음]
	//   {어떤내용이던 상관없음}
	//   (어떤내용이던 상관없음)
	//   "어떤내용이던 상관없음"
	//   '어떤내용이던 상관없음'
	//   <어떤내용이던 상관없음>
	//  => [ ( ] )   (x)
	//  => [ ( ) ]   (o)
	//  => {[ ( ) ]}  (o)
	//   이거는 안됨.

}

// => 주석 (코멘트)
// 초록색글자는 프로그램에 아무런 영향을 안끼침
// 
//#include <iostream>
// include 포함하다 . (iostream) 에 대한 내용
// iostream >> input, output에대한 stream 정보를 담고있는 곳
// input => 입력 (사용자 키보드 입력) (마우스 입력)
// output => 화면에 출력하는것들 (글자출력)

// using namespace std;
// 아직 사용안하는데 나중에 많이 쓸거라, 미리 계속 적어두는 느낌

// void main() {}
// >> 모든 프로그램은 "main" 이라는 실행점을 찾아서 실행함.
// 콘솔만 그런게 아니라 "모든 프로그램" 입니다.


// 언어
	// 영어, 일본어
	// 처음에는 다외움
	// 프로그래밍도 처음에는 다외워야됨.
	// 그러다보니 외울량이 많음
	// 3개월정도는 잘외우는 사람이 잘할 수 밖에 없는 구조